In [1]:
import pandas as pd
T_df = pd.read_csv("./titanic_train.csv")

## [ 데이터 Selection, Filtering ]

### 1. DataFrame의 [ ] 연산자

#### [ ] 안에 컬럼명 문자, 컬럼명의 리스트 객체가 들어갈 수 있다.

#### 단일 컬럼 데이터 추출

In [2]:
print("단일 컬럼 데이터 추출:\n", T_df["Pclass"].head(3))

단일 컬럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

#### 여러 컬럼들의 데이터 추출

In [3]:
print("여러 컬럼 데이터 추출:\n", T_df[["Survived", "Pclass"]].head(3))

여러 컬럼 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

#### 연산자 [ ] 안에 숫자 index -> 오류

In [ ]:
print("[ ] 안에 숫자 index는 오류 발생:\n", T_df[0])
# 오류 발생

#### 연산자 [ ]에 Pandas Index 형태로 변환가능한 표현식은 입력 가능

In [4]:
T_df[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### 2. DataFrame ix[ ] : 명칭/위치 기반 인덱싱 -> 사라진 듯

### 3. DataFrame iloc[ ] : 위치기반 인덱싱

#### 새로운 DataFrame 생성

In [5]:
D = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
D_df = pd.DataFrame(D, index=['one','two','three','four'])
D_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

#### iloc[0, 0] 수행

In [6]:
D_df.iloc[0, 0]

'Chulmin'

#### iloc[0, "Name"] -> 오류 발생

In [ ]:
D_df.iloc[0, "Name"]
# 오류 발생

#### iloc["one", 0] -> 오류 발생

In [ ]:
D_df.iloc["one", 0]
# 오류 발생

#### DataFrame을 reset

In [7]:
# D_df의 새로운 숫자형 index 생성
D_df_Re = D_df.reset_index()
D_df_Re = D_df_Re.rename(columns={"index":"old_index"})

# index가 1부터 시작하는 index 값 생성
D_df_Re.index = D_df_Re.index+1

# print
D_df_Re

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

#### reset한 DataFrame을 iloc[0, 1]

In [8]:
D_df_Re.iloc[0, 1]

'Chulmin'

#### iloc slicing 수행

In [9]:
D_df.iloc[0:1, 0]

one    Chulmin
Name: Name, dtype: object

### 4. DataFrame loc[ ] : 명칭기반 인덱싱

In [10]:
D_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

#### D_df에  loc["one", "Name"] 수행

In [11]:
D_df.loc["one", "Name"]

'Chulmin'

In [12]:
D_df_Re

  old_index      Name  Year  Gender
1       one   Chulmin  2011    Male
2       two  Eunkyung  2016  Female
3     three  Jinwoong  2015    Male
4      four   Soobeom  2015    Male

#### D_df_Re에 loc[1, "Name"] 수행

In [13]:
D_df_Re.loc[1, "Name"]

'Chulmin'

#### D_df_Re에 loc[0, "Name"] 수행 -> 오류 발생

In [ ]:
D_df_Re.loc[0, "Name"]
# 오류 발생

#### loc slicing 수행 1

In [14]:
D_df.loc["one":"two", "Name"]

one     Chulmin
two    Eunkyung
Name: Name, dtype: object

#### loc slicing 수행 2

In [15]:
D_df_Re.loc[1:2, "Name"]

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

### 5. 불린 인덱싱 (Boolean indexing) : 조건식을 [ ]에 기입해 필터링

#### 불린 인덱싱 예제 1

In [16]:
T_Boolean = T_df[T_df["Age"] > 60]

print(type(T_Boolean))
T_Boolean.head(3)

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C

#### 불린 인덱싱 예제 2 - 불린 인덱싱 후 일부 컬럼 데이터 세트만 추출

In [17]:
T_df[T_df["Age"]>60][["Name", "Age"]].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

#### 불린 인덱싱 예제 3 - 일부 컬럼 데이터 세트만 추출 후 불린 인덱싱

In [18]:
T_df[["Name", "Age"]][T_df["Age"]>60].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

#### 불린 인덱싱 예제 4 - loc 활용

In [19]:
T_df.loc[T_df["Age"]>60, ["Name", "Age"]].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

#### 불린 인덱싱 예제 5 - 논리 연산자로 결합된 조건식으로 불린 인덱싱

In [20]:
T_df[(T_df["Age"]>60) & (T_df["Pclass"]==1) & (T_df["Sex"]=="female")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

#### 불린 인덱싱 예제 6 - 예제 5의 가독성 높이기

In [21]:
con1 = T_df["Age"] > 60
con2 = T_df["Pclass"] == 1
con3 = T_df["Sex"] == "female"
T_df[con1 & con2 & con3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN